SoCXin/CH32V203/IAP/M0/3_Device/MM32L06xx_s/Include/reg_i2c.h
////////////////////////////////////////////////////////////////////////////////
/// @file     reg_i2c.h
/// @author   AE TEAM
/// @brief    THIS FILE CONTAINS ALL THE FUNCTIONS PROTOTYPES FOR THE SERIES OF
///           MM32 FIRMWARE LIBRARY.
////////////////////////////////////////////////////////////////////////////////
/// @attention
///
/// THE EXISTING FIRMWARE IS ONLY FOR REFERENCE, WHICH IS DESIGNED TO PROVIDE
/// CUSTOMERS WITH CODING INFORMATION ABOUT THEIR PRODUCTS SO THEY CAN SAVE
/// TIME. THEREFORE, MINDMOTION SHALL NOT BE LIABLE FOR ANY DIRECT, INDIRECT OR
/// CONSEQUENTIAL DAMAGES ABOUT ANY CLAIMS ARISING OUT OF THE CONTENT OF SUCH
/// HARDWARE AND/OR THE USE OF THE CODING INFORMATION CONTAINED HEREIN IN
/// CONNECTION WITH PRODUCTS MADE BY CUSTOMERS.
///
/// <H2><CENTER>&COPY; COPYRIGHT MINDMOTION </CENTER></H2>
////////////////////////////////////////////////////////////////////////////////

// Define to prevent recursive inclusion

#ifndef __REG_I2C_H
#define __REG_I2C_H

// Files includes

#include <stdint.h>
#include <stdbool.h>
#include "types.h"




#if defined ( __CC_ARM )
#pragma anon_unions
#endif








////////////////////////////////////////////////////////////////////////////////
/// @brief I2C Base Address Definition
////////////////////////////////////////////////////////////////////////////////
#define I2C1_BASE                       (APB1PERIPH_BASE + 0x5400)              ///< Base Address: 0x40005400



////////////////////////////////////////////////////////////////////////////////
/// @brief I2C Register Structure Definition
////////////////////////////////////////////////////////////////////////////////
#undef USENCOMBINEREGISTER
#undef USENNEWREGISTER
#undef USENOLDREGISTER
#define USENCOMBINEREGISTER
#ifdef USENCOMBINEREGISTER
typedef struct {
    union {
        __IO u16 CR;                                                           ///< Control Register                               offset: 0x00
        __IO u16 IC_CON;
    };
    __IO u16 RESERVED0;
    union {
        __IO u16 TAR;                                                          ///< Target Address Register                        offset: 0x04
        __IO u16 IC_TAR;
    };
    __IO u16 RESERVED1;
    union {
        __IO u16 SAR;                                                          ///< Slave Address Register                         offset: 0x08
        __IO u16 IC_SAR;
    };
    __IO u16 RESERVED2;
    __IO u16 IC_HS_MADDR_RESERVED;                                         ///< Reserved Register                              offset: 0x0C
    __IO u16 RESERVED3;
    union {
        __IO u16 DR;                                                           ///< Data Command Register                          offset: 0x10
        __IO u16 IC_DATA_CMD;
    };
    __IO u16 RESERVED4;
    union {
        __IO u16 SSHR;                                                         ///< SCL High Period Count for Std. Speed Register  offset: 0x14
        __IO u16 IC_SS_SCL_HCNT;
    };
    __IO u16 RESERVED5;
    union {
        __IO u16 SSLR;                                                         ///< SCL Low Period Count for Std. Speed Register   offset: 0x18
        __IO u16 IC_SS_SCL_LCNT;
    };
    __IO u16 RESERVED6;
    union {
        __IO u16 FSHR;                                                         ///< SCL High Period Count for Fast Speed Register  offset: 0x1C
        __IO u16 IC_FS_SCL_HCNT;
    };
    __IO u16 RESERVED7;
    union {
        __IO u16 FSLR;                                                         ///< SCL Low Period Count for Fast Speed Register   offset: 0x20
        __IO u16 IC_FS_SCL_LCNT;
    };
    __IO u16 RESERVED8;
    __IO u16 IC_HS_SCL_HCNT_RESERVED;                                      ///< Reserved Register                              offset: 0x24
    __IO u16 RESERVED9;
    __IO u16 IC_HS_SCL_LCNT_RESERVED;                                      ///< Reserved Register                              offset: 0x28
    __IO u16 RESERVED10;
    union {
        __IO u16 ISR;                                                          ///< Interrupt Status Register                      offset: 0x2C
        __IO u16 IC_INTR_STAT;
    };
    __IO u16 RESERVED11;
    union {
        __IO u16 IMR;                                                          ///< Interrupt Mask Register                        offset: 0x30
        __IO u16 IC_INTR_MASK;
    };
    __IO u16 RESERVED12;
    union {
        __IO u16 RAWISR;                                                       ///< RAW Interrupt Status Register                  offset: 0x34
        __IO u16 IC_RAW_INTR_STAT;
    };
    __IO u16 RESERVED13;
    union {
        __IO u16 RXTLR;                                                        ///< Receive FIFO Threshold Level Register          offset: 0x38
        __IO u16 IC_RX_TL;
    };
    __IO u16 RESERVED14;
    union {
        __IO u16 TXTLR;                                                        ///< Transmit FIFO Threshold Level Register         offset: 0x3C
        __IO u16 IC_TX_TL;
    };
    __IO u16 RESERVED15;
    union {
        __IO u16 ICR;                                                          ///< Clear All Interrupt Register                   offset: 0x40
        __IO u16 IC_CLR_INTR;
    };
    __IO u16 RESERVED16;
    union {
        __IO u16 RX_UNDER;                                                     ///< Clear RX_UNDER Interrupt Register              offset: 0x44
        __IO u16 IC_CLR_RX_UNDER;
    };
    __IO u16 RESERVED17;
    union {
        __IO u16 RX_OVER;                                                      ///< Clear RX_OVER Interrupt Register               offset: 0x48
        __IO u16 IC_CLR_RX_OVER;
    };
    __IO u16 RESERVED18;
    union {
        __IO u16 TX_OVER;                                                      ///< Clear TX_OVER Interrupt Register               offset: 0x4C
        __IO u16 IC_CLR_TX_OVER;
    };
    __IO u16 RESERVED19;
    union {
        __IO u16 RD_REQ;                                                       ///< Clear RD_REQ Interrupt Register                offset: 0x50
        __IO u16 IC_CLR_RD_REQ;
    };
    __IO u16 RESERVED20;
    union {
        __IO u16 TX_ABRT;                                                      ///< Clear TX_ABRT Interrupt Register               offset: 0x54
        __IO u16 IC_CLR_TX_ABRT;
    };
    __IO u16 RESERVED21;
    union {
        __IO u16 RX_DONE;                                                      ///< Clear RX_DONE Interrupt Register               offset: 0x58
        __IO u16 IC_CLR_RX_DONE;
    };
    __IO u16 RESERVED22;
    union {
        __IO u16 ACTIV;                                                        ///< Clear ACTIVITY Interrupt Register              offset: 0x5C
        __IO u16 IC_CLR_ACTIVITY;
    };
    __IO u16 RESERVED23;
    union {
        __IO u16 STOP;                                                         ///< Clear STOP_DET Interrupt Register              offset: 0x60
        __IO u16 IC_CLR_STOP_DET;
    };
    __IO u16 RESERVED24;
    union {
        __IO u16 START;                                                        ///< Clear START_DET Interrupt Register             offset: 0x64
        __IO u16 IC_CLR_START_DET;
    };
    __IO u16 RESERVED25;
    union {
        __IO u16 GC;                                                           ///< Clear GEN_CALL Interrupt Register              offset: 0x68
        __IO u16 IC_CLR_GEN_CALL;
    };
    __IO u16 RESERVED26;
    union {
        __IO u16 ENR;                                                          ///< Enable Register                                offset: 0x6C
        __IO u16 IC_ENABLE;
    };
    __IO u16 RESERVED27;
    union {
        __IO u32 SR;                                                           ///< Status Register                                offset: 0x70
        __IO u32 IC_STATUS;
    };
    union {
        __IO u32 TXFLR;                                                        ///< Transmit FIFO Level Register                   offset: 0x74
        __IO u32 IC_TXFLR;
    };
    union {
        __IO u32 RXFLR;                                                        ///< Receive FIFO Level Register                    offset: 0x78
        __IO u32 IC_RXFLR;
    };
    union {
        __IO u32 HOLD;                                                         ///< SDA Hold Time Register                         offset: 0x7C
        __IO u32 IC_SDA_HOLD;
    };
    __IO u32 RESERVED28;                                                   ///IC_TX_ABRT_SOURCE_RESERVED;
    __IO u32 RESERVED29;                                                   ///IC_SLV_DATA_NACK_ONLY_RESERVED;

    union {
        __IO u32 DMA;                                                          ///< DMA Control Register                           offset: 0x88
        __IO u32 IC_DMA_CR;
    };
    __IO u32 RESERVED30;                                                   ///IC_DMA_TDLR_RESERVED;
    __IO u32 RESERVED31;                                                   ///IC_DMA_RDLR_RESERVED;
    union {
        __IO u32 SETUP;                                                        ///< SDA Setup Time Register                        offset: 0x94
        __IO u32 IC_SDA_SETUP;
    };
    union {
        __IO u32 GCR;                                                          ///< ACK General Call Register                      offset: 0x98
        __IO u32 IC_ACK_GENERAL_CALL;
    };
} I2C_TypeDef;
#endif
#ifdef USENNEWREGISTER
typedef struct {
    __IO u16 CR;                                                                ///< Control Register                               offset: 0x00
    __IO u16 RESERVED0;
    __IO u16 TAR;                                                               ///< Target Address Register                        offset: 0x04
    __IO u16 RESERVED1;
    __IO u16 SAR;                                                               ///< Slave Address Register                         offset: 0x08
    __IO u16 RESERVED2;
    __IO u32 RESERVED3;
    __IO u16 DR;                                                                ///< Data Command Register                          offset: 0x10
    __IO u16 RESERVED4;
    __IO u16 SSHR;                                                              ///< SCL High Period Count for Std. Speed Register  offset: 0x14
    __IO u16 RESERVED5;
    __IO u16 SSLR;                                                              ///< SCL Low Period Count for Std. Speed Register   offset: 0x18
    __IO u16 RESERVED6;
    __IO u16 FSHR;                                                              ///< SCL High Period Count for Fast Speed Register  offset: 0x1C
    __IO u16 RESERVED7;
    __IO u16 FSLR;                                                              ///< SCL Low Period Count for Fast Speed Register   offset: 0x20
    __IO u16 RESERVED8;
    __IO u32 RESERVED9;
    __IO u32 RESERVED10;
    __IO u16 ISR;                                                               ///< Interrupt Status Register                      offset: 0x2C
    __IO u16 RESERVED11;
    __IO u16 IMR;                                                               ///< Interrupt Mask Register                        offset: 0x30
    __IO u16 RESERVED12;
    __IO u16 RAWISR;                                                            ///< RAW Interrupt Status Register                  offset: 0x34
    __IO u16 RESERVED13;
    __IO u16 RXTLR;                                                             ///< Receive FIFO Threshold Level Register          offset: 0x38
    __IO u16 RESERVED14;
    __IO u16 TXTLR;                                                             ///< Transmit FIFO Threshold Level Register         offset: 0x3C
    __IO u16 RESERVED15;
    __IO u16 ICR;                                                               ///< Clear All Interrupt Register                   offset: 0x40
    __IO u16 RESERVED16;
    __IO u16 RX_UNDER;                                                          ///< Clear RX_UNDER Interrupt Register              offset: 0x44
    __IO u16 RESERVED17;
    __IO u16 RX_OVER;                                                           ///< Clear RX_OVER Interrupt Register               offset: 0x48
    __IO u16 RESERVED18;
    __IO u16 TX_OVER;                                                           ///< Clear TX_OVER Interrupt Register               offset: 0x4C
    __IO u16 RESERVED19;
    __IO u16 RD_REQ;                                                            ///< Clear RD_REQ Interrupt Register                offset: 0x50
    __IO u16 RESERVED20;
    __IO u16 TX_ABRT;                                                           ///< Clear TX_ABRT Interrupt Register               offset: 0x54
    __IO u16 RESERVED21;
    __IO u16 RX_DONE;                                                           ///< Clear RX_DONE Interrupt Register               offset: 0x58
    __IO u16 RESERVED22;
    __IO u16 ACTIV;                                                             ///< Clear ACTIVITY Interrupt Register              offset: 0x5C
    __IO u16 RESERVED23;
    __IO u16 STOP;                                                              ///< Clear STOP_DET Interrupt Register              offset: 0x60
    __IO u16 RESERVED24;
    __IO u16 START;                                                             ///< Clear START_DET Interrupt Register             offset: 0x64
    __IO u16 RESERVED25;
    __IO u16 GC;                                                                ///< Clear GEN_CALL Interrupt Register              offset: 0x68
    __IO u16 RESERVED26;
    __IO u16 ENR;                                                               ///< Enable Register                                offset: 0x6C
    __IO u16 RESERVED27;
    __IO u32 SR;                                                                ///< Status Register                                offset: 0x70
    __IO u32 TXFLR;                                                             ///< Transmit FIFO Level Register                   offset: 0x74
    __IO u32 RXFLR;                                                             ///< Receive FIFO Level Register                    offset: 0x78
    __IO u32 HOLD;                                                              ///< SDA Hold Time Register                         offset: 0x7C
    __IO u32 RESERVED28;
    __IO u32 RESERVED29;
    __IO u32 DMA;                                                               ///< DMA Control Register                           offset: 0x88
#if defined(__M0T1)
    __IO u32 RESERVED29a;                                                               ///< reserved Register                           offset: 0x88
#endif
    __IO u32 RESERVED30;
    __IO u32 RESERVED31;
    __IO u32 SETUP;                                                             ///< SDA Setup Time Register                        offset: 0x94
    __IO u32 GCR;                                                               ///< ACK General Call Register                      offset: 0x98
} I2C_TypeDef;
#endif
#ifdef USENOLDREGISTER
typedef struct {
    __IO u16 IC_CON;
    __IO u16 RESERVED0;
    __IO u16 IC_TAR;
    __IO u16 RESERVED1;
    __IO u16 IC_SAR;
    __IO u16 RESERVED2;
    __IO u16 IC_HS_MADDR_RESERVED;
    __IO u16 RESERVED3;
    __IO u16 IC_DATA_CMD;
    __IO u16 RESERVED4;
    __IO u16 IC_SS_SCL_HCNT;
    __IO u16 RESERVED5;
    __IO u16 IC_SS_SCL_LCNT;
    __IO u16 RESERVED6;
    __IO u16 IC_FS_SCL_HCNT;
    __IO u16 RESERVED7;
    __IO u16 IC_FS_SCL_LCNT;
    __IO u16 RESERVED8;
    __IO u16 IC_HS_SCL_HCNT_RESERVED;
    __IO u16 RESERVED9;
    __IO u16 IC_HS_SCL_LCNT_RESERVED;
    __IO u16 RESERVED10;
    __IO u16 IC_INTR_STAT;
    __IO u16 RESERVED11;
    __IO u16 IC_INTR_MASK;
    __IO u16 RESERVED12;
    __IO u16 IC_RAW_INTR_STAT;
    __IO u16 RESERVED13;
    __IO u16 IC_RX_TL;
    __IO u16 RESERVED14;
    __IO u16 IC_TX_TL;
    __IO u16 RESERVED15;
    __IO u16 IC_CLR_INTR;
    __IO u16 RESERVED16;
    __IO u16 IC_CLR_RX_UNDER;
    __IO u16 RESERVED17;
    __IO u16 IC_CLR_RX_OVER;
    __IO u16 RESERVED18;
    __IO u16 IC_CLR_TX_OVER;
    __IO u16 RESERVED19;
    __IO u16 IC_CLR_RD_REQ;
    __IO u16 RESERVED20;
    __IO u16 IC_CLR_TX_ABRT;
    __IO u16 RESERVED21;
    __IO u16 IC_CLR_RX_DONE;
    __IO u16 RESERVED22;
    __IO u16 IC_CLR_ACTIVITY;
    __IO u16 RESERVED23;
    __IO u16 IC_CLR_STOP_DET;
    __IO u16 RESERVED24;
    __IO u16 IC_CLR_START_DET;
    __IO u16 RESERVED25;
    __IO u16 IC_CLR_GEN_CALL;
    __IO u16 RESERVED26;
    __IO u16 IC_ENABLE;
    __IO u16 RESERVED27;
    __IO u32 IC_STATUS;
    __IO u32 IC_TXFLR;
    __IO u32 IC_RXFLR;
    __IO u32 IC_SDA_HOLD;
    __IO u32 IC_TX_ABRT_SOURCE_RESERVED;
    __IO u32 IC_SLV_DATA_NACK_ONLY_RESERVED;
    __IO u32 IC_DMA_CR;
    __IO u32 IC_DMA_TDLR_RESERVED;
    __IO u32 IC_DMA_RDLR_RESERVED;
    __IO u32 IC_SDA_SETUP;
    __IO u32 IC_ACK_GENERAL_CALL;
} I2C_TypeDef;
#endif



////////////////////////////////////////////////////////////////////////////////
/// @brief I2C type pointer Definition
////////////////////////////////////////////////////////////////////////////////
#define I2C1                            ((I2C_TypeDef*)I2C1_BASE)



////////////////////////////////////////////////////////////////////////////////
/// @brief I2C_CR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define I2C_CR_MASTER_Pos               (0)
#define I2C_CR_MASTER                   (0x01U << I2C_CR_MASTER_Pos)            ///< I2C master mode enable
#define I2C_CR_SPEED_Pos                (1)
#define I2C_CR_SPEED                    (0x03U << I2C_CR_SPEED_Pos)             ///< I2C speed mode
#define I2C_CR_STD                      (0x01U << I2C_CR_SPEED_Pos)             ///< I2C standard speed mode
#define I2C_CR_FAST                     (0x02U << I2C_CR_SPEED_Pos)             ///< I2C fast speed mode
#define I2C_CR_SLAVE10_Pos              (3)
#define I2C_CR_SLAVE10                  (0x01U << I2C_CR_SLAVE10_Pos)           ///< I2C slave mode responds to 10-bit address
#define I2C_CR_MASTER10_Pos             (4)
#define I2C_CR_MASTER10                 (0x01U << I2C_CR_MASTER10_Pos)          ///< I2C master mode responds to 10-bit address
#define I2C_CR_REPEN_Pos                (5)
#define I2C_CR_REPEN                    (0x01U << I2C_CR_REPEN_Pos)             ///< Enable send RESTART
#define I2C_CR_SLAVEDIS_Pos             (6)
#define I2C_CR_SLAVEDIS                 (0x01U << I2C_CR_SLAVEDIS_Pos)          ///< I2C slave mode disable
#define I2C_CR_STOPINT_Pos              (7)
#define I2C_CR_STOPINT                  (0x01U << I2C_CR_STOPINT_Pos)           ///< Generate STOP interrupt in slave mode
#define I2C_CR_EMPINT_Pos               (8)
#define I2C_CR_EMPINT                   (0x01U << I2C_CR_EMPINT_Pos)            ///< I2C TX_EMPTY interrupt

